Autodesk.Revit.DB.CoordinatePlaneVisibility
Visibility settings for ReferencePoint element's coordinate reference planes.
Since:
2013

Autodesk.Revit.DB.CoordinatePlaneVisibility.Always
Always Visible.

Autodesk.Revit.DB.CoordinatePlaneVisibility.WhenSelected
Visible when selected.

Autodesk.Revit.DB.CoordinatePlaneVisibility.Never
Never visible.